MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K142W/include/S32K142W_features.h
/*!
 * @brief Enumeration for target module of TRGMUX
 *
 * Describes all possible outputs (target modules) of the TRGMUX IP
 * This enumeration depends on the supported instances in device
 */
enum trgmux_target_module_e
{
    TRGMUX_TARGET_MODULE_DMA_CH0                   =0U,
    TRGMUX_TARGET_MODULE_DMA_CH1                   =1U,
    TRGMUX_TARGET_MODULE_DMA_CH2                   =2U,
    TRGMUX_TARGET_MODULE_DMA_CH3                   =3U,
    TRGMUX_TARGET_MODULE_TRGMUX_OUT0               =4U,
    TRGMUX_TARGET_MODULE_TRGMUX_OUT1               =5U,
    TRGMUX_TARGET_MODULE_TRGMUX_OUT2               =6U,
    TRGMUX_TARGET_MODULE_TRGMUX_OUT3               =7U,
    TRGMUX_TARGET_MODULE_TRGMUX_OUT4               =8U,
    TRGMUX_TARGET_MODULE_TRGMUX_OUT5               =9U,
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA0           =12U,
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA1           =13U,
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA2           =14U,
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA3           =15U,
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA0           =16U,
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA1           =17U,
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA2           =18U,
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA3           =19U,
    TRGMUX_TARGET_MODULE_CMP0_SAMPLE               =28U,
    TRGMUX_TARGET_MODULE_FTM0_HWTRIG0              =40U,
    TRGMUX_TARGET_MODULE_FTM0_FAULT0               =41U,
    TRGMUX_TARGET_MODULE_FTM0_FAULT1               =42U,
    TRGMUX_TARGET_MODULE_FTM0_FAULT2               =43U,
    TRGMUX_TARGET_MODULE_FTM1_HWTRIG0              =44U,
    TRGMUX_TARGET_MODULE_FTM1_FAULT0               =45U,
    TRGMUX_TARGET_MODULE_FTM1_FAULT1               =46U,
    TRGMUX_TARGET_MODULE_FTM1_FAULT2               =47U,
    TRGMUX_TARGET_MODULE_FTM2_HWTRIG0              =48U,
    TRGMUX_TARGET_MODULE_FTM2_FAULT0               =49U,
    TRGMUX_TARGET_MODULE_FTM2_FAULT1               =50U,
    TRGMUX_TARGET_MODULE_FTM2_FAULT2               =51U,
    TRGMUX_TARGET_MODULE_FTM3_HWTRIG0              =52U,
    TRGMUX_TARGET_MODULE_FTM3_FAULT0               =53U,
    TRGMUX_TARGET_MODULE_FTM3_FAULT1               =54U,
    TRGMUX_TARGET_MODULE_FTM3_FAULT2               =55U,
    TRGMUX_TARGET_MODULE_PDB0_TRG_IN               =56U,
    TRGMUX_TARGET_MODULE_PDB1_TRG_IN               =60U,
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM0           =68U,
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM1           =69U,
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM2           =70U,
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM3           =71U,
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH0              =72U,
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH1              =73U,
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH2              =74U,
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH3              =75U,
    TRGMUX_TARGET_MODULE_LPUART0_TRG               =76U,
    TRGMUX_TARGET_MODULE_LPUART1_TRG               =80U,
    TRGMUX_TARGET_MODULE_LPI2C0_TRG                =84U,
    TRGMUX_TARGET_MODULE_LPSPI0_TRG                =92U,
    TRGMUX_TARGET_MODULE_LPSPI1_TRG                =96U,
    TRGMUX_TARGET_MODULE_LPTMR0_ALT0               =100U
};

/* @brief Constant array storing the value of all TRGMUX output(target module) identifiers */
#define FEATURE_TRGMUX_TARGET_MODULE           \
{                                              \
    TRGMUX_TARGET_MODULE_DMA_CH0,              \
    TRGMUX_TARGET_MODULE_DMA_CH1,              \
    TRGMUX_TARGET_MODULE_DMA_CH2,              \
    TRGMUX_TARGET_MODULE_DMA_CH3,              \
    TRGMUX_TARGET_MODULE_TRGMUX_OUT0,          \
    TRGMUX_TARGET_MODULE_TRGMUX_OUT1,          \
    TRGMUX_TARGET_MODULE_TRGMUX_OUT2,          \
    TRGMUX_TARGET_MODULE_TRGMUX_OUT3,          \
    TRGMUX_TARGET_MODULE_TRGMUX_OUT4,          \
    TRGMUX_TARGET_MODULE_TRGMUX_OUT5,          \
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA0,      \
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA1,      \
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA2,      \
    TRGMUX_TARGET_MODULE_ADC0_ADHWT_TLA3,      \
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA0,      \
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA1,      \
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA2,      \
    TRGMUX_TARGET_MODULE_ADC1_ADHWT_TLA3,      \
    TRGMUX_TARGET_MODULE_CMP0_SAMPLE,          \
    TRGMUX_TARGET_MODULE_FTM0_HWTRIG0,         \
    TRGMUX_TARGET_MODULE_FTM0_FAULT0,          \
    TRGMUX_TARGET_MODULE_FTM0_FAULT1,          \
    TRGMUX_TARGET_MODULE_FTM0_FAULT2,          \
    TRGMUX_TARGET_MODULE_FTM1_HWTRIG0,         \
    TRGMUX_TARGET_MODULE_FTM1_FAULT0,          \
    TRGMUX_TARGET_MODULE_FTM1_FAULT1,          \
    TRGMUX_TARGET_MODULE_FTM1_FAULT2,          \
    TRGMUX_TARGET_MODULE_FTM2_HWTRIG0,         \
    TRGMUX_TARGET_MODULE_FTM2_FAULT0,          \
    TRGMUX_TARGET_MODULE_FTM2_FAULT1,          \
    TRGMUX_TARGET_MODULE_FTM2_FAULT2,          \
    TRGMUX_TARGET_MODULE_FTM3_HWTRIG0,         \
    TRGMUX_TARGET_MODULE_FTM3_FAULT0,          \
    TRGMUX_TARGET_MODULE_FTM3_FAULT1,          \
    TRGMUX_TARGET_MODULE_FTM3_FAULT2,          \
    TRGMUX_TARGET_MODULE_PDB0_TRG_IN,          \
    TRGMUX_TARGET_MODULE_PDB1_TRG_IN,          \
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM0,      \
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM1,      \
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM2,      \
    TRGMUX_TARGET_MODULE_FLEXIO_TRG_TIM3,      \
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH0,         \
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH1,         \
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH2,         \
    TRGMUX_TARGET_MODULE_LPIT_TRG_CH3,         \
    TRGMUX_TARGET_MODULE_LPUART0_TRG,          \
    TRGMUX_TARGET_MODULE_LPUART1_TRG,          \
    TRGMUX_TARGET_MODULE_LPI2C0_TRG,           \
    TRGMUX_TARGET_MODULE_LPSPI0_TRG,           \
    TRGMUX_TARGET_MODULE_LPSPI1_TRG,           \
    TRGMUX_TARGET_MODULE_LPTMR0_ALT0           \
}

/**********************************************************************
 *           DMA module features
 **********************************************************************/

/* @brief DMA hardware version 2. */
#define FEATURE_DMA_HWV2
/* @brief Number of DMA channels. */
#define FEATURE_DMA_CHANNELS (16U)
/* @brief Number of DMA virtual channels. */
#define FEATURE_DMA_VIRTUAL_CHANNELS (FEATURE_DMA_CHANNELS * DMA_INSTANCE_COUNT)
/* @brief Number of DMA interrupt lines. */
#define FEATURE_DMA_CHANNELS_INTERRUPT_LINES (16U)
/* @brief Number of DMA virtual interrupt lines. */
#define FEATURE_DMA_VIRTUAL_CHANNELS_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_CHANNELS_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief Number of DMA error interrupt lines. */
#define FEATURE_DMA_ERROR_INTERRUPT_LINES (1U)
/* @brief Number of DMA virtual error interrupt lines. */
#define FEATURE_DMA_VIRTUAL_ERROR_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_ERROR_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief DMA module has error interrupt. */
#define FEATURE_DMA_HAS_ERROR_IRQ
/* @brief DMA module separate interrupt lines for each channel */
#define FEATURE_DMA_SEPARATE_IRQ_LINES_PER_CHN
/* @brief Conversion from channel index to DCHPRI index. */
#define FEATURE_DMA_CHN_TO_DCHPRI_INDEX(x) ((x) ^ 3U)
/* @brief DMA channel groups count. */
#define FEATURE_DMA_CHANNEL_GROUP_COUNT (1U)
/* @brief Clock name for DMA */
#define FEATURE_DMA_CLOCK_NAMES {SIM_DMA_CLK}
/* @brief DMA channel width based on number of TCDs: 2^N, N=4,5,... */
#define FEATURE_DMA_CH_WIDTH (4U)
/* @brief DMA channel to instance */
#define FEATURE_DMA_VCH_TO_INSTANCE(x) 	((x) >> (uint32_t)FEATURE_DMA_CH_WIDTH)
/* @brief DMA virtual channel to channel */
#define FEATURE_DMA_VCH_TO_CH(x)        ((x) & ((uint32_t)FEATURE_DMA_CHANNELS - 1U))
/* @brief DMA supports the following particular transfer size: */
#define FEATURE_DMA_TRANSFER_SIZE_16B
#define FEATURE_DMA_TRANSFER_SIZE_32B

/**********************************************************************
 *           DMAMUX module features
 **********************************************************************/

/* @brief DMAMUX peripheral is available in silicon. */
#define FEATURE_DMAMUX_AVAILABLE
/* @brief Number of DMA channels. */
#define FEATURE_DMAMUX_CHANNELS (16U)
/* @brief Has the periodic trigger capability */
#define FEATURE_DMAMUX_HAS_TRIG (1)
/* @brief Conversion from request source to the actual DMAMUX channel */
#define FEATURE_DMAMUX_REQ_SRC_TO_CH(x) (x)
/* @brief Mapping between request source and DMAMUX instance */
#define FEATURE_DMAMUX_REQ_SRC_TO_INSTANCE(x) (0U)
/* @brief Conversion from eDMA channel index to DMAMUX channel. */
#define FEATURE_DMAMUX_DMA_CH_TO_CH(x) (x)
/* @brief Conversion from DMAMUX channel DMAMUX register index. */
#define FEATURE_DMAMUX_CHN_REG_INDEX(x) (x)
/* @brief Clock names for DMAMUX. */
#define FEATURE_DMAMUX_CLOCK_NAMES {DMAMUX0_CLK}
/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */

